# Дан список чисел. Определите сколько в нем встречается различных чисел.

l_1 = [1, 2, 3, 1, 1, 2, 3, 5, 1, 2, 2]
count = len(set(l_1))
print(count)

